{
  "movies": [
    {
      "Title": "Source Code",
      "ApiId": "45612",
      "Genre": "Thriller,Science Fiction,Mystery",
      "Overview": "When decorated soldier Captain Colter Stevens wakes up in the body of an unknown man, he discovers he's part of a mission to find the bomber of a Chicago commuter train.",
      "Poster": "/faCR2lavXBKeCS6N7STIMDLMCDL.jpg",
      "Year": "2011-03-30",
      "Runtime": "94",
      "IMDBid": "tt0945513",
      "Trailer": "t5roJgHV_lA",
      "id": 1
    },
    {
      "Title": "Wonder Woman",
      "ApiId": "297762",
      "Genre": "Action,Adventure,Fantasy",
      "Overview": "An Amazon princess comes to the world of Man in the grips of the First World War to confront the forces of evil and bring an end to human conflict.",
      "Poster": "/imekS7f1OuHyUP2LAiTEM0zBzUz.jpg",
      "Year": "2017-05-30",
      "Runtime": "141",
      "IMDBid": "tt0451279",
      "Trailer": "sFM2QBrtV0Y",
      "id": 2
    },
    {
      "Title": "Spider-Man",
      "ApiId": "557",
      "Genre": "Fantasy,Action",
      "Overview": "After being bitten by a genetically altered spider at Oscorp, nerdy but endearing high school student Peter Parker is endowed with amazing powers to become the superhero known as Spider-Man.",
      "Poster": "/gh4cZbhZxyTbgxQPxD0dOudNPTn.jpg",
      "Year": "2002-05-01",
      "Runtime": "121",
      "IMDBid": "tt0145487",
      "Trailer": "1sCdl0u9VvI",
      "id": 3
    },
    {
      "Title": "Battleship",
      "ApiId": "44833",
      "Genre": "Thriller,Action,Adventure,Science Fiction",
      "Overview": "When mankind beams a radio signal into space, a reply comes from ‘Planet G’, in the form of several alien crafts that splash down in the waters off Hawaii. Lieutenant Alex Hopper is a weapons officer assigned to the USS John Paul Jones, part of an international naval coalition which becomes the world's last hope for survival as they engage the hostile alien force of unimaginable strength. While taking on the invaders, Hopper must also try to live up to the potential that his brother, and his fiancée's father—an Admiral—expect of him.",
      "Poster": "/9b0Im7SfedHiajTwzSL9zGyBI7M.jpg",
      "Year": "2012-04-11",
      "Runtime": "131",
      "IMDBid": "tt1440129",
      "Trailer": "Yp9zjCq0TKM",
      "id": 4
    },
    {
      "Title": "Full Metal Jacket",
      "ApiId": "600",
      "Genre": "Drama,War",
      "Overview": "A pragmatic U.S. Marine observes the dehumanizing effects the U.S.-Vietnam War has on his fellow recruits from their brutal boot camp training to the bloody street fighting in Hue.",
      "Poster": "/kMKyx1k8hWWscYFnPbnxxN4Eqo4.jpg",
      "Year": "1987-06-26",
      "Runtime": "117",
      "IMDBid": "tt0093058",
      "Trailer": "n2i917l5RFc",
      "id": 5
    },
    {
      "Title": "Fifty Shades of Grey",
      "ApiId": "216015",
      "Genre": "Drama,Romance,Thriller",
      "Overview": "When college senior Anastasia Steele steps in for her sick roommate to interview prominent businessman Christian Grey for their campus paper, little does she realize the path her life will take. Christian, as enigmatic as he is rich and powerful, finds himself strangely drawn to Ana, and she to him. Though sexually inexperienced, Ana plunges headlong into an affair -- and learns that Christian's true sexual proclivities push the boundaries of pain and pleasure.",
      "Poster": "/63kGofUkt1Mx0SIL4XI4Z5AoSgt.jpg",
      "Year": "2015-02-11",
      "Runtime": "125",
      "IMDBid": "tt2322441",
      "Trailer": "hGvD1CubwNY",
      "id": 6
    },
    {
      "Title": "The Wedding Singer",
      "ApiId": "11003",
      "Genre": "Romance,Comedy",
      "Overview": "Robbie, a local rock star turned wedding singer, is dumped on the day of his wedding. Meanwhile, waitress Julia finally sets a wedding date with her fiancée Glenn. When Julia and Robbie meet and hit it off, they find that things are more complicated than anybody thought.",
      "Poster": "/zVvyTrcZQb7kC2DPDzyo25WcxXp.jpg",
      "Year": "1998-02-13",
      "Runtime": "100",
      "IMDBid": "tt0120888",
      "Trailer": "8yjOXMTa6vA",
      "id": 8
    },
    {
      "Title": "Just Go with It",
      "ApiId": "50546",
      "Genre": "Comedy,Romance",
      "Overview": "A plastic surgeon, romancing a much younger schoolteacher, enlists his loyal assistant to pretend to be his soon to be ex-wife, in order to cover up a careless lie. When more lies backfire, the assistant's kids become involved, and everyone heads off for a weekend in Hawaii that will change all their lives.",
      "Poster": "/ez1EDULOCUUCySHOZU6tz97qbtM.jpg",
      "Year": "2011-02-10",
      "Runtime": "117",
      "IMDBid": "tt1564367",
      "Trailer": "fpj7i2CPt8M",
      "id": 9
    },
    {
      "Title": "Transformers: The Last Knight",
      "ApiId": "335988",
      "Genre": "Action,Adventure,Science Fiction",
      "Overview": "Autobots and Decepticons are at war, with humans on the sidelines. Optimus Prime is gone. The key to saving our future lies buried in the secrets of the past, in the hidden history of Transformers on Earth.",
      "Poster": "/s5HQf2Gb3lIO2cRcFwNL9sn1o1o.jpg",
      "Year": "2017-06-16",
      "Runtime": "154",
      "IMDBid": "tt3371366",
      "Trailer": "e_uBTsgRJlk",
      "id": 10
    },
    {
      "Title": "Transformers: Dark of the Moon",
      "ApiId": "38356",
      "Genre": "Action,Science Fiction,Adventure",
      "Overview": "The Autobots continue to work for NEST, now no longer in secret. But after discovering a strange artifact during a mission in Chernobyl, it becomes apparent to Optimus Prime that the United States government has been less than forthright with them.",
      "Poster": "/28YlCLrFhONteYSs9hKjD1Km0Cj.jpg",
      "Year": "2011-06-28",
      "Runtime": "154",
      "IMDBid": "tt1399103",
      "Trailer": "XeUtb5L9iNE",
      "id": 11
    },
    {
      "Title": "Batman: The Dark Knight Returns, Part 2",
      "ApiId": "142061",
      "Genre": "Science Fiction,Action,Animation,Mystery",
      "Overview": "Batman has stopped the reign of terror that The Mutants had cast upon his city.  Now an old foe wants a reunion and the government wants The Man of Steel to put a stop to Batman.",
      "Poster": "/arEZYd6uMOFTILne9Ux0A8qctMe.jpg",
      "Year": "2013-01-03",
      "Runtime": "78",
      "IMDBid": "tt2166834",
      "Trailer": "dD2VyqyKvwg",
      "id": 12
    },
    {
      "Title": "Superman Returns",
      "ApiId": "1452",
      "Genre": "Science Fiction,Action,Adventure",
      "Overview": "Superman returns to discover his 5-year absence has allowed Lex Luthor to walk free, and that those he was closest to felt abandoned and have moved on. Luthor plots his ultimate revenge that could see millions killed and change the face of the planet forever, as well as ridding himself of the Man of Steel.",
      "Poster": "/385XwTQZDpRX2d3kxtnpiLrjBXw.jpg",
      "Year": "2006-06-28",
      "Runtime": "154",
      "IMDBid": "tt0348150",
      "Trailer": "fOWIpF5yIIY",
      "id": 13
    },
    {
      "Title": "Catch Me If You Can",
      "ApiId": "640",
      "Genre": "Drama,Crime",
      "Overview": "A true story about Frank Abagnale Jr. who, before his 19th birthday, successfully conned millions of dollars worth of checks as a Pan Am pilot, doctor, and legal prosecutor. An FBI agent makes it his mission to put him behind bars. But Frank not only eludes capture, he revels in the pursuit.",
      "Poster": "/ctjEj2xM32OvBXCq8zAdK3ZrsAj.jpg",
      "Year": "2002-12-16",
      "Runtime": "141",
      "IMDBid": "tt0264464",
      "Trailer": "71rDQ7z4eFg",
      "id": 14
    },
    {
      "Title": "Split",
      "ApiId": "381288",
      "Genre": "Horror,Thriller",
      "Overview": "Though Kevin has evidenced 23 personalities to his trusted psychiatrist, Dr. Fletcher, there remains one still submerged who is set to materialize and dominate all the others. Compelled to abduct three teenage girls led by the willful, observant Casey, Kevin reaches a war for survival among all of those contained within him — as well as everyone around him — as the walls between his compartments shatter apart.",
      "Poster": "/lli31lYTFpvxVBeFHWoe5PMfW5s.jpg",
      "Year": "2017-01-19",
      "Runtime": "117",
      "IMDBid": "tt4972582",
      "Trailer": "hyHPKlbkUZI",
      "id": 15
    },
    {
      "Title": "13 Assassins",
      "ApiId": "58857",
      "Genre": "Adventure,Drama,Action",
      "Overview": "A bravado period action film set at the end of Japan's feudal era in which a group of unemployed samurai are enlisted to bring down a sadistic lord and prevent him from ascending to the throne and plunging the country into a war-torn future.",
      "Poster": "/yUsVsiVXUwClk4vSCx80vrdO6MV.jpg",
      "Year": "2010-09-09",
      "Runtime": "141",
      "IMDBid": "tt1436045",
      "Trailer": "Xpm007vne54",
      "id": 16
    },
    {
      "Title": "Frozen II",
      "ApiId": "330457",
      "Genre": "Family,Animation,Adventure,Comedy,Fantasy",
      "Overview": "Elsa, Anna, Kristoff and Olaf head far into the forest to learn the truth about an ancient mystery of their kingdom.",
      "Poster": "/mINJaa34MtknCYl5AjtNJzWj8cD.jpg",
      "Year": "2019-11-20",
      "Runtime": "103",
      "IMDBid": "tt4520988",
      "Trailer": "FRe2toPFn9Q",
      "id": 17
    },
    {
      "Title": "Soul",
      "ApiId": "508442",
      "Genre": "Animation,Family,Comedy,Fantasy,Drama",
      "Overview": "Joe Gardner is a middle school teacher with a love for jazz music. After a successful audition at the Half Note Club, he suddenly gets into an accident that separates his soul from his body and is transported to the You Seminar, a center in which souls develop and gain passions before being transported to a newborn child. Joe must enlist help from the other souls-in-training, like 22, a soul who has spent eons in the You Seminar, in order to get back to Earth.",
      "Poster": "/hm58Jw4Lw8OIeECIq5qyPYhAeRJ.jpg",
      "Year": "2020-12-25",
      "Runtime": "101",
      "IMDBid": "tt2948372",
      "Trailer": "SANuzmkuNEo",
      "id": 18
    },
    {
      "Title": "Halloween II",
      "ApiId": "24150",
      "Genre": "Horror",
      "Overview": "Laurie Strode struggles to come to terms with her brother Michael's deadly return to Haddonfield, Illinois. Meanwhile, Michael prepares for another reunion with his sister.",
      "Poster": "/vSHPM4LQDpWdQrD5KZWK6wNqSOD.jpg",
      "Year": "2009-08-28",
      "Runtime": "105",
      "IMDBid": "tt1311067",
      "Trailer": "KXkcgqmKZ2Y",
      "id": 19
    }
  ]
}